LeonMeln/esp32p4-android-auto/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# Chip revision — support v1.x (pre-v3.0 silicon)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# SPIRAM (PSRAM) — needed for frame buffers on ESP32-P4
# (Waveshare ESP32-P4-WIFI6-Touch-LCD-4.3 ships with 32MB Hex PSRAM @200MHz)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# (Skipping CONFIG_SPIRAM_XIP_FROM_PSRAM and CONFIG_CACHE_L2_CACHE_256KB:
#  they sound like nice optimizations but eat enough internal SRAM that
#  FreeRTOS fails to allocate the IdleTask stack on boot.)

# USB Host
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=1024
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y

# LVGL
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_32=y

# Waveshare BSP — never abort() on init errors. GT911 touch occasionally
# fails its first I2C read on cold boot (timing-sensitive); we want the
# display to come up anyway and the caller to handle the error.
CONFIG_BSP_ERROR_CHECK=n

# ===== ESP-Hosted (P4 host <-> C6 slave over SDIO) =====
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"

CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000

CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54

CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=20
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=20
CONFIG_ESP_HOSTED_USE_MEMPOOL=y

# ===== WiFi Remote (transparent esp_wifi API on P4) =====
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_WIFI_REMOTE_EAP_ENABLED=y

# WiFi buffers
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=32

# lwIP — bigger socket count for AA TCP server
CONFIG_LWIP_MAX_SOCKETS=12

# main_task stack must NOT land in the 8KB TCM region on ESP32-P4
# (esp_ptr_in_dram() rejects TCM, breaking spi_flash_mmap during nvs_flash_init).
# Bumping past 8KB forces allocation in L2 SRAM.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# ===== Flash + partitions (32MB GD25... on Waveshare 4.3 board) =====
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# ===== Android Auto head unit =====
# Default role STA: head unit joins an existing network (bench setup).
# Creds come from main/bench_wifi.h (gitignored) when present, otherwise from
# CONFIG_AA_WIFI_SSID/CONFIG_AA_WIFI_PASSWORD set via menuconfig.
# Switch to CONFIG_AA_WIFI_ROLE_AP=y for SoftAP production behaviour.
CONFIG_AA_WIFI_ROLE_STA=y

# ===== C6 slave OTA on boot (firmware embedded in host bin) =====
CONFIG_C6_OTA_ENABLED=y
CONFIG_C6_OTA_DISPLAY_PROGRESS=y
